Revit 2027 API
BuiltInFailures.RebarCouplerFailures.LengthParameterWarning Property
 This is used to post warning. The "Total Length" parameter must be set to a strictly positive value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LengthParameterWarning { get; }
Public Shared ReadOnly Property LengthParameterWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LengthParameterWarning {
	FailureDefinitionId^ get ();
}
static member LengthParameterWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarCouplerFailures Class
Autodesk.Revit.DB Namespace